/*
#############################################################################################
# Special Force 2 (1.0.46397.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: SFGameContent_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL, crylessdomore
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Script Structs
# ========================================================================================= #
*/

// ScriptStruct SFGameContent.SFCItem_M870_KnockBack.KnockBackData
// 0x0014
struct FKnockBackData
{
	unsigned char                                      UsableGameMode;                                   		// 0x0000 (0x0001) [0x0000000000000000]              
	float                                              StoppingPower;                                    		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              StoppingPowerDuration;                            		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              AccelRatePctWhenStoppingPowerDuration;            		// 0x000C (0x0004) [0x0000000000000000]              
	float                                              KnockBackPower;                                   		// 0x0010 (0x0004) [0x0000000000000000]              
};


#ifdef _MSC_VER
	#pragma pack ( pop )
#endif