/*
#############################################################################################
# Special Force 2 (1.0.46397.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: SFGameContent_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL, crylessdomore
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function SFGameContent.SFCItem_Sakura_Summer_DefSuit.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Sakura_Summer_DefSuit_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_EagleEye_WhiteSuit.ApplyItemToHostPawn
// [0x00022000] 
struct USFCItem_EagleEye_WhiteSuit_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Char_Face_Meiden.PostApplyItemInternal
// [0x00022002] 
struct USFCItem_Char_Face_Meiden_execPostApplyItemInternal_Parms
{
	class AActor*                                      AppliedActor;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bUsePenalty : 1;                                  		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	// class ASFPawn*                                  SFP;                                              		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function SFGameContent.SFCItem_GIGN_WhiteNightSuit.ApplyItemToHostPawn
// [0x00022000] 
struct USFCItem_GIGN_WhiteNightSuit_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_BlackMamba_BeachwearSuit.ApplyItemToHostPawn
// [0x00022000] 
struct USFCItem_BlackMamba_BeachwearSuit_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCWeaponRIS_ActionCamo_Kill.OwnerKill
// [0x00020102] 
struct USFCWeaponRIS_ActionCamo_Kill_execOwnerKill_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFGameContent.SFCitem_Common_Casino_Shoes.ApplyItemToHostPawn
// [0x00022002] 
struct USFCitem_Common_Casino_Shoes_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Casino_Shirts.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Casino_Shirts_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Bomber_Hat.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Bomber_Hat_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_bomber_Jacket.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_bomber_Jacket_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Bomber_Pants.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Bomber_Pants_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_RiotGear_Boots.ApplyItemToPawn
// [0x00022002] 
struct USFCItem_Common_RiotGear_Boots_execApplyItemToPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_GIGN_Colombiana_Pants.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_GIGN_Colombiana_Pants_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Colombiana_Pants.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Colombiana_Pants_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Colombiana_Boots.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Colombiana_Boots_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_GIGN_Colombiana_Jacket.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_GIGN_Colombiana_Jacket_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Colombiana_Jacket.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Colombiana_Jacket_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_SFWCGear_Jacket.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_SFWCGear_Jacket_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_GIGN_SFWCGear_Glove.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_GIGN_SFWCGear_Glove_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_SFWCGear_Glove.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_SFWCGear_Glove_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_GIGN_SFWCGear_Jacket.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_GIGN_SFWCGear_Jacket_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Shirts_SFWC2017_PMS.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Shirts_SFWC2017_PMS_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Shirts_SFWC.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Shirts_SFWC_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Shirts_SFWC2017_THA.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Shirts_SFWC2017_THA_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Shirts_SFWC2017_JPN.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Shirts_SFWC2017_JPN_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Shirts_SFWC2017_KOR.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Shirts_SFWC2017_KOR_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_SFWCGear_Boots.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_SFWCGear_Boots_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_SFWCGear_Pants.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_SFWCGear_Pants_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_SFWCGear_Head.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_SFWCGear_Head_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_EODPants.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_EODPants_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_EODJacket.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_EODJacket_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_EODMask.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_EODMask_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Terrormask3.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Terrormask3_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_SuitPants.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_SuitPants_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_SuitJacket.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_SuitJacket_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_RiotHelmet.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_RiotHelmet_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Shirts_PPAllStarWhite.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Shirts_PPAllStarWhite_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Shirts_PPAllStarFlag.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Shirts_PPAllStarFlag_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Shirts_PHBlack.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Shirts_PHBlack_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Shirts_Sera.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Shirts_Sera_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_ChickenBoots.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_ChickenBoots_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_ChickenPants.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_ChickenPants_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_ChickenBody.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_ChickenBody_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_ChickenMask.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_ChickenMask_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCWeaponRIS_ActionCamo_Equip.OwnerAttached
// [0x00020102] 
struct USFCWeaponRIS_ActionCamo_Equip_execOwnerAttached_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFGameContent.SFCItem_Func_WeaponCamo_Removal.GetSpecificIndexWithDataByID
// [0x00426002] 
struct USFCItem_Func_WeaponCamo_Removal_execGetSpecificIndexWithDataByID_Parms
{
	class UObject*                                     SpecificObject;                                   		// 0x0000 (0x0004) [0x0000000000000190]              ( CPF_OptionalParm | CPF_Parm | CPF_OutParm )
	class UObject*                                     SpecificObjectEx;                                 		// 0x0004 (0x0004) [0x0000000000000190]              ( CPF_OptionalParm | CPF_Parm | CPF_OutParm )
	int                                                SpecificIndex;                                    		// 0x0008 (0x0004) [0x0000000000000190]              ( CPF_OptionalParm | CPF_Parm | CPF_OutParm )
	int                                                SpecificIndexEx;                                  		// 0x000C (0x0004) [0x0000000000000190]              ( CPF_OptionalParm | CPF_Parm | CPF_OutParm )
};

// Function SFGameContent.SFCItem_Common_SmartTelecom.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_SmartTelecom_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_MonkeyBackPack.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_MonkeyBackPack_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_MechanixGlove.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_MechanixGlove_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Ghoulmask.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Ghoulmask_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Shorts_Blue.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Shorts_Blue_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Shorts_Red.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Shorts_Red_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Towel_Crocodile.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Towel_Crocodile_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Func_ProvideFastC4.ApplyItemToHostActor
// [0x00022002] 
struct USFCItem_Func_ProvideFastC4_execApplyItemToHostActor_Parms
{
	class AActor*                                      AppliedActor;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class ASFPlayerController*                      SFPC;                                             		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function SFGameContent.SFCItem_Func_ProvideFastC4.IsPossibleToUse
// [0x00022002] 
struct USFCItem_Func_ProvideFastC4_execIsPossibleToUse_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ASFGameReplicationInfo*                   SFGRI;                                            		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function SFGameContent.SFCItem_Func_ProvideFastDISARMPDA.ApplyItemToHostActor
// [0x00022002] 
struct USFCItem_Func_ProvideFastDISARMPDA_execApplyItemToHostActor_Parms
{
	class AActor*                                      AppliedActor;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class ASFPlayerController*                      SFPC;                                             		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function SFGameContent.SFCItem_Func_ProvideFastDISARMPDA.IsPossibleToUse
// [0x00022002] 
struct USFCItem_Func_ProvideFastDISARMPDA_execIsPossibleToUse_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ASFGameReplicationInfo*                   SFGRI;                                            		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function SFGameContent.SFCItem_Common_Towel_Duck.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Towel_Duck_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Flippers_Green.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Flippers_Green_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Gothloli_Vampire_DefSuit.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Gothloli_Vampire_DefSuit_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_DuckMask.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_DuckMask_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_CrocodileMask.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_CrocodileMask_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Summercap.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Summercap_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Watergoggles.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Watergoggles_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Flippers_Yellow.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Flippers_Yellow_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_SFWCCap.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_SFWCCap_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_SFWCBandana.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_SFWCBandana_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_SFWCglove.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_SFWCglove_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_GIGN_Shirts_SFWC.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_GIGN_Shirts_SFWC_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_GIGN_Tattoo_Shirts_03.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_GIGN_Tattoo_Shirts_03_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Tattoo_Shirts_03.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Tattoo_Shirts_03_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_GIGN_Tattoo_Shirts_02.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_GIGN_Tattoo_Shirts_02_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Tattoo_Shirts_02.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Tattoo_Shirts_02_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_GIGN_Tattoo_Shirts_01.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_GIGN_Tattoo_Shirts_01_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Tattoo_Shirts_01.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Tattoo_Shirts_01_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_GIGN_Tattoo_Arm_02.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_GIGN_Tattoo_Arm_02_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_GIGN_Tattoo_Nude.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_GIGN_Tattoo_Nude_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Tattoo_Arm_02.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Tattoo_Arm_02_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Tattoo_Nude.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Tattoo_Nude_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_GIGN_Tattoo_Arm_01.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_GIGN_Tattoo_Arm_01_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Tattoo_Arm_01.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Tattoo_Arm_01_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_CombatGlove_D.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_CombatGlove_D_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_CombatGlove.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_CombatGlove_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_BattleGlove.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_BattleGlove_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_SpeedUpBoots.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_SpeedUpBoots_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_CombatBoots_D.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_CombatBoots_D_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_CombatBoots.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_CombatBoots_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_BattleBoots.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_BattleBoots_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_PumpkinHelmet.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_PumpkinHelmet_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Shirts_Skeleton.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Shirts_Skeleton_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Scope_Zeiess.ApplyItemToWeap
// [0x00022002] 
struct USFCItem_Common_Scope_Zeiess_execApplyItemToWeap_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Scope_Bender.ApplyItemToWeap
// [0x00022002] 
struct USFCItem_Common_Scope_Bender_execApplyItemToWeap_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Cz700_Def_Scope.ApplyItemToWeap
// [0x00022002] 
struct USFCItem_Cz700_Def_Scope_execApplyItemToWeap_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_AWP_Def_Scope.ApplyItemToWeap
// [0x00022002] 
struct USFCItem_AWP_Def_Scope_execApplyItemToWeap_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_FAMAS_Def_Sight.ApplyItemToWeap
// [0x00022000] 
struct USFCItem_FAMAS_Def_Sight_execApplyItemToWeap_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_CheyTac_Def_Scope.ApplyItemToWeap
// [0x00022002] 
struct USFCItem_CheyTac_Def_Scope_execApplyItemToWeap_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Scope_K14_winter.ApplyItemToWeap
// [0x00022002] 
struct USFCItem_Common_Scope_K14_winter_execApplyItemToWeap_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Scope_PM2.ApplyItemToWeap
// [0x00022002] 
struct USFCItem_Common_Scope_PM2_execApplyItemToWeap_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Barret_Def_Scope.ApplyItemToWeap
// [0x00022002] 
struct USFCItem_Barret_Def_Scope_execApplyItemToWeap_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_SVCh_Scope_Bender.ApplyItemToWeap
// [0x00022002] 
struct USFCItem_SVCh_Scope_Bender_execApplyItemToWeap_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Scope_Kar98k.ApplyItemToWeap
// [0x00022002] 
struct USFCItem_Common_Scope_Kar98k_execApplyItemToWeap_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_BowieKnife.ApplyItemToWeapByPenalty
// [0x00022002] 
struct USFCItem_BowieKnife_execApplyItemToWeapByPenalty_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Scope_Dragunov.ApplyItemToWeap
// [0x00022002] 
struct USFCItem_Common_Scope_Dragunov_execApplyItemToWeap_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_SR25_Def_Scope.ApplyItemToWeap
// [0x00022002] 
struct USFCItem_SR25_Def_Scope_execApplyItemToWeap_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_GPM30A1.ApplyItemToWeapByPenalty
// [0x00022002] 
struct USFCItem_GPM30A1_execApplyItemToWeapByPenalty_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Scope_S2S.ApplyItemToWeap
// [0x00022002] 
struct USFCItem_Common_Scope_S2S_execApplyItemToWeap_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_PSG1_Def_Scope.ApplyItemToWeap
// [0x00022002] 
struct USFCItem_PSG1_Def_Scope_execApplyItemToWeap_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Scope_S2S_Once.ApplyItemToWeap
// [0x00022002] 
struct USFCItem_Scope_S2S_Once_execApplyItemToWeap_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Shirts_Pirate.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Shirts_Pirate_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Shirts_Clan_Blue.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Shirts_Clan_Blue_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Shirts_Clan.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Shirts_Clan_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Shirts_Clan_Black.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Shirts_Clan_Black_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Shirts_Clan_Red.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Shirts_Clan_Red_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Shirts_Running_Matrix.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Shirts_Running_Matrix_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Shirts_Running_Leopard.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Shirts_Running_Leopard_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Shirts_Running_NBD.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Shirts_Running_NBD_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_Shirts_Python.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_Shirts_Python_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_UDT_PirateEye.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_UDT_PirateEye_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_GIGN_PirateEye.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_GIGN_PirateEye_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_GAFE_PirateEye.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_GAFE_PirateEye_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_SAS_PirateEye.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_SAS_PirateEye_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Spetsnaz_PirateEye.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Spetsnaz_PirateEye_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Delta_PirateEye.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Delta_PirateEye_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_MurderKnife.ApplyItemToWeapByPenalty
// [0x00022002] 
struct USFCItem_MurderKnife_execApplyItemToWeapByPenalty_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_UDT_PirateHat.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_UDT_PirateHat_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_GIGN_PirateHat.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_GIGN_PirateHat_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_SAS_PirateHat.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_SAS_PirateHat_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_GAFE_PirateHat.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_GAFE_PirateHat_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Spetsnaz_PirateHat.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Spetsnaz_PirateHat_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Delta_PirateHat.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Delta_PirateHat_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_M870_KnockBack.ApplyItemToWeap
// [0x00022002] 
struct USFCItem_M870_KnockBack_execApplyItemToWeap_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_M870_KnockBack.ApplyItemToHostWeap
// [0x00022002] 
struct USFCItem_M870_KnockBack_execApplyItemToHostWeap_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_M870_KnockBack.SetKnockBackParams
// [0x00022002] 
struct USFCItem_M870_KnockBack_execSetKnockBackParams_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// unsigned char                                   CurrentGameMode;                                  		// 0x0004 (0x0001) [0x0000000000000000]              
	// int                                             DataCount;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function SFGameContent.SFCItem_Func_ProvideWallet.ApplyItemToHostActorEx
// [0x00022002] 
struct USFCItem_Func_ProvideWallet_execApplyItemToHostActorEx_Parms
{
	class ASFShooterDefencePlayerReplicationInfo*      ShooterPRI;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ValIdx;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_P226_Def_Body.ApplyItemToWeap
// [0x00022000] 
struct USFCItem_P226_Def_Body_execApplyItemToWeap_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_P226_Def_Magazine.ApplyItemToWeap
// [0x00022000] 
struct USFCItem_P226_Def_Magazine_execApplyItemToWeap_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_P226_Def_Sight.ApplyItemToWeap
// [0x00022000] 
struct USFCItem_P226_Def_Sight_execApplyItemToWeap_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Dagger.ApplyItemToWeapByPenalty
// [0x00022002] 
struct USFCItem_Dagger_execApplyItemToWeapByPenalty_Parms
{
	class ASFWeapon*                                   AppliedWeap;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Func_ProvideStat.ApplyItemToHostActorEx
// [0x00022002] 
struct USFCItem_Func_ProvideStat_execApplyItemToHostActorEx_Parms
{
	class ASFShooterDefencePlayerReplicationInfo*      ShooterPRI;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ValIdx;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Func_AddPrimaryMagazine.ApplyMagazine
// [0x00022002] 
struct USFCItem_Func_AddPrimaryMagazine_execApplyMagazine_Parms
{
	class ASFWeapon*                                   SFW;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Func_AddPrimaryMagazine.ApplyItemToHostActor
// [0x00022002] 
struct USFCItem_Func_AddPrimaryMagazine_execApplyItemToHostActor_Parms
{
	class AActor*                                      AppliedActor;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class ASFWeapon*                                SFW;                                              		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             J;                                                		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function SFGameContent.SFCItem_Func_PvE_Haste.ApplyItemToHostActor
// [0x00022002] 
struct USFCItem_Func_PvE_Haste_execApplyItemToHostActor_Parms
{
	class AActor*                                      AppliedActor;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class ASFGameInfo*                              SFGI;                                             		// 0x0004 (0x0004) [0x0000000000000000]              
	// class AWorldInfo*                               WI;                                               		// 0x0008 (0x0004) [0x0000000000000000]              
	// unsigned long                                   bResult : 1;                                      		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function SFGameContent.SFCItem_Beacon_RequestUAV.ApplyItemToHostActor
// [0x00022002] 
struct USFCItem_Beacon_RequestUAV_execApplyItemToHostActor_Parms
{
	class AActor*                                      AppliedActor;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Func_InstantShockWave.ApplyItemToHostActor
// [0x00022002] 
struct USFCItem_Func_InstantShockWave_execApplyItemToHostActor_Parms
{
	class AActor*                                      AppliedActor;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             I;                                                		// 0x0004 (0x0004) [0x0000000000000000]              
	// class ASFPawn*                                  AppliedPawn;                                      		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function SFGameContent.SFCItem_Func_RecoveryHP.CanPurchaseInGameStore
// [0x00022002] 
struct USFCItem_Func_RecoveryHP_execCanPurchaseInGameStore_Parms
{
	class ASFPawn*                                     ApplidedPawn;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFGameContent.SFCItem_Func_RecoveryHP.ApplyItemToActor
// [0x00022002] 
struct USFCItem_Func_RecoveryHP_execApplyItemToActor_Parms
{
	class AActor*                                      AppliedActor;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Func_MiniMapPing.ApplyItemToActor
// [0x00022002] 
struct USFCItem_Func_MiniMapPing_execApplyItemToActor_Parms
{
	class AActor*                                      AppliedActor;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class ASFPlayerReplicationInfo*                 SFPRI;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function SFGameContent.SFCItem_Func_ProvideHumanHealth.IsPossibleToUse
// [0x00022002] 
struct USFCItem_Func_ProvideHumanHealth_execIsPossibleToUse_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFGameContent.SFCItem_Func_FreeInstantRespawn.ApplyItemToActor
// [0x00022002] 
struct USFCItem_Func_FreeInstantRespawn_execApplyItemToActor_Parms
{
	class AActor*                                      AppliedActor;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class ASFPlayerReplicationInfo*                 SFPRI;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function SFGameContent.SFCItem_Func_PrimaryMagazineUp.ApplyItemToHostActor
// [0x00022002] 
struct USFCItem_Func_PrimaryMagazineUp_execApplyItemToHostActor_Parms
{
	class AActor*                                      AppliedActor;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class ASFWeapon*                                TempWeapon;                                       		// 0x0004 (0x0004) [0x0000000000000000]              
	// class ASFGameReplicationInfo*                   SFGRI;                                            		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function SFGameContent.SFCItem_SAS_CombatPants.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_SAS_CombatPants_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_SAS_BattlePants.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_SAS_BattlePants_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_SAS_CombatJacket.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_SAS_CombatJacket_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_SAS_BattleJacket.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_SAS_BattleJacket_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_Common_GasMask.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_Common_GasMask_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_SAS_CombatHelmet.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_SAS_CombatHelmet_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_GAFE_CombatPants.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_GAFE_CombatPants_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_GAFE_BattlePants.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_GAFE_BattlePants_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_GAFE_CombatJacket.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_GAFE_CombatJacket_execApplyItemToHostPawn_Parms
{
	class ASFPawn*                                     AppliedPawn;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFGameContent.SFCItem_GAFE_BattleJacket.ApplyItemToHostPawn
// [0x00022002] 
struct USFCItem_GAFE_BattleJacket_execApplyItemToHostPawn_Parms
{
